[~] docs: ASCII -> mermaid.
